config.org
#+BEGIN_QUOTE
Que sais-je ?
#+END_QUOTE
#+title: The REAL 2e Asteroid CONFIG
#+author: 2e Asteroid (Dan.)

* Motivations
Before I start, I want to outline some key goals and rules that I should always keep in the back of my mind when I start configuring.
*Goals:*
 - Construct a functional and ergonomic (enough) /text/ editor that can support any text manipulations I need.
 - Create a clean, aesthetic, easy-on-the-eyes screen that makes me want to stay in Emacs longer, not run out of it.
 - Conjure Emacs fast and easy -- none of that waiting 20 minutes.
 - Have software reproducible from anywhere.

*Rules:*
 - When choosing between function and flow, choose a median between either.
 - Make text manipulation and entering keyboard-focused, none of that buttons and widgets.
 - However, using a mouse is fine.
 - Choose a median between simple and complex, something that starts off easy and can grow along with me.
 - Fuck bells

Thanks to all of the other Emacs configs that I stole a snippet or two of code from.
*Some Notable Configs:*
 - https://emacs.metaphoric.dev/
 - https://github.com/protesilaos/dotfiles
 - https://raw.githubusercontent.com/wiki/domtronn/all-the-icons.el/Mode%20Line.md
 -


* Constant Data
This just has stuff like name, email, operating system, and so on.
#+BEGIN_SRC emacs-lisp

  (defconst *2e/full-name* "Daniel Lin"
    "Stores your full name.")
  (defconst *2e/display-name* "Daniel L."
    "Stores your display name.")
  (defconst *2e/email* "two-e-asteroid@outlook.com"
    "Stores your main email address.")

#+END_SRC

#+RESULTS:
: *2e/email*


* Bootstrap
** "Sane" Defaults
What's sanity these days except for a human construct for the comprehensible?
#+BEGIN_SRC emacs-lisp

  (when (display-graphic-p)        ; When Emacs is running as a GUI (gooey???) application
    (blink-cursor-mode 0)          ; Stops the cursor from blinking; it's actually kind of annoying now that I think about it
    (scroll-bar-mode 0)            ; Removes the scroll bar at the right -- you don't /really/ need this
    (tool-bar-mode 0)              ; Removes the buttons, "fit a square into a circular hole" tool bar (Or is this the textual one?)
    (tooltip-mode 0))              ; Removes tool tips from appearing in popup windows
  (setq use-dialog-box nil         ; For dialog regarding stuff, don't use a popup window
        use-file-dialog nil)       ; Same thing as above, except for files, me thinks

#+END_SRC

#+RESULTS:

** "More Sane" Defaults
If sanity is the comprehensible, then let's make it more comprehensible!
#+BEGIN_SRC emacs-lisp

  (setq-default                             ; This sets variables, but for buffer-local vars, it sets it as the default.
   ad-redefinition-action 'accept           ; This makes it so that when you redefine an existing function, it accepts that, and won't warn you about it. Developer knows best..

   auto-window-vscroll nil                  ; This makes vertical scrolling better for terminals.

   confirm-kill-emacs 'y-or-n-p             ; Allows you to kill Emacs with just y and n. I don't think you need to be typing words out here.

   cursor-in-non-selected-windows nil       ; You're not editing in those windows, so you don't have to know where the cursor is.

   delete-by-moving-to-trash t              ; Takes deleted files to the trash, so you can quickly restore a file if needed.

   display-time-default-load-average nil    ; Removes the CPU load average after the time.

   display-time-format "%k:%M:%S (%Z)"      ; Displays the time as "24 Hours With Fill: Minutes : Seconds (Time Zone)"

   fill-column 80                           ; This controls when stuff like Auto-Fill-Mode will wrap.

   help-window-select t                     ; This gives the focused window spotlight to help windows when you open them

   indent-tabs-mode nil                     ; The classic Tabs v. Spaces argument. Shut the fuck up.

   inhibit-startup-screen t                 ; This removes the classic but sadly out-of-place starting screen.

   initial-scratch-message ""               ; Instead of some helpful statements, we don't give the scratch buffer a message

   mouse-yank-at-point t                    ; Making Emacs mouse yanking a bit better, je pense...

   ns-use-srgb-colorspace nil               ; Using Adobe RGB instead of standardRGB, since it has more colors

   select-enable-clipboard t                ; Mind-melding the system clipboard with the Emacs clipboard, to make stuff easier.

   sentence-end-double-space nil            ; Double SPACES ?!?

   show-help-function nil                   ; 'Tis for the tool bar, which we don't use

   show-trailing-whitespace t               ; Making trailing whitespace more visible

   split-height-threshold 80                ; Some window splitting stuff

   split-width-threshold 40                 ; Same thing here

   tab-width 4                              ; A 4 tab-width is standard

   uniquify-buffer-name-style 'forward      ; In case of the same file name, this'll show the different directories the files are in, with a "/".

   window-combination-resize t              ; Resizes the windows proportionally

   x-stretch-cursor nil                     ; Makes the cursor stretch to fit the glyph it's on, which looks kind of bad, actually

   delete-old-versions nil                  ; Storage is cheap, while ideas are ephemeral

   version-control t                        ; Version control is useful always

   ring-bell-function 'ignore               ; Shut up, PLEASE

   inhibit-compacting-font-caches t         ; Uses more memory, but speedier

   recentf-mode t                           ; Shows recent files

   make-backup-files t                      ; Ideas are ephemeral

   display-line-numbers-type 'relative      ; Just in case I use display-line-numbers (Never-ish)

   vc-follow-symlinks t                     ; Symlinks

   use-default-font-for-symbols nil         ; We don't want the same font for everything, unless we specify it.

   frame-inhibit-implied-resize nil         ; Symlink

   pop-up-windows nil)                      ; Just annoying

  (cd "~/")                                 ; Takes us to the home directory.

  (delete-selection-mode 1)                 ; Instead of just yanking to the buffer, we remove what we highlighted when we yank to text

  (display-time)                            ; What does this do? Only time will tell.

  (global-auto-revert-mode 1)               ; Changes on the disk means changes in Emacs

  (fringe-mode '(8 . 0))                    ; Leaves some space on the left for git / magit(?)

  (electric-pair-mode t)                    ; Automatically inserts closing parentheses, etc.

  (electric-indent-mode t)                  ; Automatically indents for you

  (defalias 'yes-or-no-p 'y-or-n-p)         ; More conciseness! Yummy

  (global-subword-mode 1)                   ; It can now iterate through camelCase words

  (menu-bar-mode 0)                         ; It's still kind of useful

  (mouse-avoidance-mode 'jump)              ; No more collisions

  (put 'downcase-region 'disabled nil)      ; Enables downcase-region

  (put 'upcase-region 'disabled nil)        ; Enables upcase-region

  (show-paren-mode 1)                       ; Really useful -- it highlights the matching parentheses, or makes it turn a warning color

  (add-hook 'calendar-mode-hook (lambda () (setq show-trailing-whitespace nil)))           ; Trailing whitespace makes it look weird

#+END_SRC

#+RESULTS:
| (lambda nil (setq show-trailing-whitespace nil)) | org--setup-calendar-bindings |

** Fullscreen?! Yippee
#+BEGIN_SRC emacs-lisp

  (if (string-equal window-system 'ns)
      (toggle-frame-maximized)
    (toggle-frame-fullscreen))

#+END_SRC

#+RESULTS:

** Focusing out of a Buffer will Garbage Collect
#+BEGIN_SRC emacs-lisp

  (add-hook 'focus-out-hook #'garbage-collect)

#+END_SRC

#+RESULTS:
| garbage-collect |

** Save Removes Trailing Whitespace
#+BEGIN_SRC emacs-lisp

  (add-hook 'before-save-hook 'delete-trailing-whitespace)

#+END_SRC

#+RESULTS:
| delete-trailing-whitespace |

** Default to UTF-8 Encoding
#+BEGIN_SRC emacs-lisp
  (set-default-coding-systems 'utf-8)
  (set-language-environment "UTF-8")
  (setq locale-coding-system 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-keyboard-coding-system 'utf-8)
  (set-selection-coding-system 'utf-8)
  (prefer-coding-system 'utf-8)
#+END_SRC

#+RESULTS:

