config.el

(require 'no-littering)
  (setq no-littering-etc-directory
    (expand-file-name "config/" user-emacs-directory))               ; Puts all configuration files in a "config" folder.
  (setq no-littering-var-directory
    (expand-file-name "data/" user-emacs-directory))                 ; Puts all data files in a "data" folder.

(setq user-emacs-directory "C:/Users/linyi/AppData/Roaming/.emacs.d/")

  (require 'recentf)
  (add-to-list 'recentf-exclude                                          ; Excludes all no-littering files from recentf
           (recentf-expand-file-name no-littering-var-directory))
  (add-to-list 'recentf-exclude                                          ; ^
           (recentf-expand-file-name no-littering-etc-directory))

  (setq custom-file (no-littering-expand-etc-file-name "custom.el"))     ; Stores Emacs' configuration interface in the config folder, called custom.el

(require 'gcmh)
(setq gcmh-low-cons-threshold 800000            ; This is the normal garbage-collection rate, when you're actively working
      gcmh-high-cons-threshold #x40000000       ; This is the idling garbage-collection rate
      gcmh-idle-delay 15                        ; How much time needs to pass to count as idle delay. Or, you can set it to auto.
      gcmh-auto-idle-delay-factor 20            ; A factor that calculates the idle delay time, if you set the idle delay to auto.
      )

(defun 2e/open-config-org-file ()                                      ; A function that opens up your configuration file
  (interactive)
  (find-file (expand-file-name "config.org" user-emacs-directory)))

(defun 2e/add-function-to-multiple-hooks (func hooks)                  ; This adds the same function to multiple hooks
  (mapc (lambda (hook)
      (add-hook hook func))
    hooks))

(defun 2e-emacs-remind (reminder parent)
(with-output-to-temp-buffer "Reminder"
  (princ (format "%s\n" reminder))
  (princ (format-time-string "Sent at: %H:%M\n"))
  (princ (format "Sent by %s\n" parent)))
(alert-toast-notify `(:title ,parent :message ,reminder :data (:alarm default :long t))))

(add-hook 'prog-mode-hook 'hl-line-mode)  ; Makes the current line be highlighted

(cond ((string-equal window-system 'w32) (progn
                                            (when (member "Segoe UI Emoji" (font-family-list))
                                              (set-fontset-font t 'symbol (font-spec :family "Segoe UI Emoji") nil 'prepend)
                                              (set-fontset-font "fontset-default" '(#xFE00 . #xFE0F) "Segoe UI Emoji"))

                                            (when (member "Times New Roman" (font-family-list))
                                              (set-fontset-font "fontset-default" 'unicode "Times New Roman"))

                                            (when (member "Unifont" (font-family-list))
                                              (set-fontset-font t nil "Unifont" nil 'append)
                                              (set-fontset-font t nil "Unifont Upper" nil 'append)))
       (string-equal window-system 'x) (progn
                                          (when (member "Noto Color Emoji" (font-family-list))
                                            (set-fontset-font t 'symbol (font-spec :family "Noto Color Emoji") nil 'prepend)
                                            (set-fontset-font "fontset-default" '(#xFE00 . #xFE0F) "Noto Color Emoji"))

                                          (when (member "Unifont" (font-family-list))
                                            (set-fontset-font t nil "Unifont" nil 'append)
                                            (set-fontset-font t nil "Unifont Upper" nil 'append)))))

(require 'fira-code-mode)

(unless (member "Fira Code Symbol" (font-family-list))
  (fira-code-mode-install-fonts))

(fira-code-mode-set-font)
(setq fira-code-mode-disabled-ligatures '("*" "?=" "[]" "x"))
(add-hook 'prog-mode-hook 'fira-code-mode)

(load-theme 'crypt t)  ; Loads my theme

(require 'all-the-icons)

(add-hook 'prog-mode-hook 'rainbow-mode)     ; Enables rainbow mode (colors the background of colors, e.g. #FFFFFF) for programming modes

(add-hook 'prog-mode-hook #'rainbow-delimiters-mode)  ; Enables Rainbow Delimiters for Programming Languages

(defun 2e/mode-line-truncate-string-p (str)
  "returns non-nil if the string should be truncated"
  (or (< (window-total-width) split-width-threshold)
       (and (> (length str) mode-line-truncate-length)
       (not (one-window-p :no-minibuffer)))))

(defvar-local mode-line-truncate-length 15)                          ; How long should a string at least be until being truncated

(defun 2e/mode-line-truncate-string (str)                        ; Truncates the string function
  "Returns the truncated string, else return the original string."
  (if (2e/mode-line-truncate-string-p str)                              ; If the string should be truncated
      (concat (substring str 0 mode-line-truncate-length) "...")     ; Add the first 9 characters of the string and append a '...' at the end.
    str))                                                            ; Else, return original string

(defun 2e/mode-line-right-align-rest-width ()
  "Returns the length to be conserved at the right side of the modeline."
  (1+ (length display-time-string)))

(defun 2e/mode-line-right-align ()
  "Returns empty space using the default 'mode-line' face and leaving RESERVE space on the right."
  (propertize " "
          'display `(space . (:align-to (- (+ right right-fringe right-margin)  ,(2e/mode-line-right-align-rest-width)))))) ; This adds up all of the space at the right of the modeline, and subtracts the space we want to conserve

(defun 2e/static-blank ()
  "Returns a string of one space."
  " ")

(defun 2e/mode-line-modified ()
