config.org
** Modeline Save/d Icon
#+BEGIN_SRC emacs-lisp
  (defun 2e/mode-line-modified ()
    "This returns a all-the-icons icon based on the modified state of the buffer."
    (let* (
           (config-alist                                                             ; Lets `config-alist` to be a list of information that we pull from
          '(("*" all-the-icons-faicon "chain-broken" :height 1.2 :v-adjust -0.0)     ; If it's `*`, then call `all-the-icons-faicon` on "chain-broken :height 1.2 :v-adjust -0.0"
            ("-" all-the-icons-faicon "link" :height 1.2 :v-adjust -0.0)             ; If it's `-`, then call `all-the-icons-faicon` on "link :height 1.2 :v-adjust -0.0"
            ("%" all-the-icons-faicon "lock" :height 1.2 :v-adjust 0.1)))            ; If it's `%`, then call `all-the-icons-faicon` on "lock :height 1.2 :v-adjust 0.1"
         (result (cdr (assoc (format-mode-line "%*") config-alist))))                ; Since it's `let*`, the variables are bound sequentially and so `result` can use `config-alist`.
        (propertize (format "%s" (apply (car result) (cdr result)))                  ; We return a propertized string
            'face `(:family ,(all-the-icons-faicon-family))                          ; The family of the font is the string returned from the function `all-the-icons-faicon-family`
            'help-echo (if (string-equal (cadr result) "chain-broken")               ; We add a minibuffer display when we hover over the icon.
                   (format "Buffer: `%s` is modified." (buffer-name))
                     (if (string-equal (cadr result) "link")
                     (format "Buffer: `%s` is saved." (buffer-name))
                     (format "Buffer: `%s` is read-only." (buffer-name)))))))
#+END_SRC

#+RESULTS:
: 2e/mode-line-modified

** Modeline Buffer/Region Information
#+BEGIN_SRC emacs-lisp
  (defun 2e/mode-line-region-info ()
    "Returns a string containing information from the current region, if there is any. The left number is the lines in the region, and the right number is the characters in the region."
    (when mark-active                                                ; When the mark is active (there's actually a highlighted region)
    (let ((lines (count-lines (region-beginning) (region-end)))      ; Set `lines` to be the amount of lines in the region
          (chars (- (region-end) (region-beginning))))               ; Sets `chars` to be the characters in the region
      (concat                                                        ; Adds the pencil octicon to the information
       (propertize (format "%s " (all-the-icons-octicon "pencil"))
                   'face `(:family ,(all-the-icons-octicon-family))
           'display `(raise -0.0))
       (propertize (format "%s:%s" lines chars)
                   'face `(:height 0.9))))))

  (defun 2e/mode-line-region-buffer-info ()
    "Returns either the output of `2e/mode-line-region-info`, or if there isn't a region marked, then return a string containing information from the entire buffer, with the left number being the lines in the buffer, and the right number being the characters in the buffer."
    (if mark-active
      (2e/mode-line-region-info)
    (concat
     (propertize
      (format "%s" (all-the-icons-octicon "pencil"))
      'face `(:family ,(all-the-icons-octicon-family))
      'display `(raise -0.0))
     (propertize
      (concat
       (format "%s:" (car (buffer-line-statistics)))
       "%i")
      'face `(:height 0.9)))))
#+END_SRC

#+RESULTS:
: 2e/mode-line-region-buffer-info

** Modeline Buffer Name, Mode, and VC Branch
#+BEGIN_SRC emacs-lisp :results silent

  (defun 2e/mode-line-buffer-name ()
    (2e/mode-line-truncate-string
     (format "%s"
             (propertize (2e/mode-line-truncate-string
                          (buffer-name))
                         'help-echo (format "Buffer Name: `%s`" (buffer-name))
                         'face `(:foreground "#dfffee")))))

  (defun 2e/mode-line-mode-icon ()
    "Returns the mode icon of the buffer."
    (propertize
     (format "%s" (all-the-icons-icon-for-mode major-mode :v-adjust 0.0))
     'help-echo (format "Major Mode: `%s`" major-mode)
     'face `(:height 170 :family ,(all-the-icons-icon-family-for-buffer))))

  (defun 2e/mode-line-github-vc ()
    (if vc-mode
        (let ((branch (cdr (string-split vc-mode "[:-]"))))
          (concat
           (propertize
            (format "%s " (all-the-icons-octicon "git-branch"))
            'face `(:family ,(all-the-icons-octicon-family) :height 1.3)
            'display `(raise -0.1))
           (propertize (2e/mode-line-truncate-string
                        (format "%s" branch))
                       'face `(:height 0.9))))
      (concat
       (propertize
        (format "%s " (all-the-icons-octicon "git-branch"))
        'face `(:family ,(all-the-icons-octicon-family) :height 1.3)
        'display `(raise -0.1))
       (propertize (format "%s" "(git init)") 'face `(:height 0.9)))))

  (defun 2e/mode-line-mode-vc-info ()
    (if vc-mode
        (let ((branch (cdr (string-split vc-mode "[:-]"))))
          (concat
           "("
           (2e/mode-line-mode-icon)
           ", "
           (propertize (2e/mode-line-truncate-string
                        (format "#%s" branch))
                       'face `(:height 0.9))
           ")"))
      (2e/mode-line-mode-icon)))


  (require 'org-timer)
  (defun 2e/mode-line-org-timer ()
    (unless (eq (org-timer-value-string) "0:00:00 ")
      (propertize (format "Timer: %s" (org-timer-value-string)) 'face `(:weight bold))))

#+END_SRC
** Modeline DateTime
#+BEGIN_SRC emacs-lisp
  (setq display-time-interval 1)                         ; Updates the time every second
  (setq-default display-time-default-load-average nil)   ; Stops the time from displaying the load average
  (display-time)                                         ; Starts displaying the time

  (defun 2e/mode-line-time ()
    "returns the time with the associated clock icon with it."
    (let* ((hour (string-to-number (format-time-string "%I")))
           (icon (all-the-icons-wicon (format "time-%s" hour) :height 1.3 :v-adjust 0.0)))
      (concat
       (propertize (format-time-string " [%d/%a] %k:%M:%S (%z) ") 'face `(:height 0.9))
       (propertize (format "%s " icon) 'face `(:height 1.0 :family ,(all-the-icons-wicon-family)) 'display '(raise -0.0)))))

#+END_SRC

#+RESULTS:
: 2e/mode-line-time

** Modeline Format
#+BEGIN_SRC emacs-lisp :results silent

  (setq-default mode-line-format
                '("%e"
                  (:eval (2e/mode-line-modified))
                  " "
                  (:eval (2e/mode-line-buffer-name))
                  " "
                  (:eval (2e/mode-line-mode-vc-info))
                  " | "
                  (:eval (2e/mode-line-region-buffer-info))
                  " | "
                  (:eval (2e/mode-line-org-timer))
                  (:eval (2e/mode-line-right-align))
                  (:eval (2e/mode-line-time))
                  ))

  (setq-default header-line-format nil)

#+END_SRC

#+RESULTS:


* Keyboard Layout
I'm using `meow` to create my keyboard layout, because I don't feel like writing tons of emacs lisp right now. This might change in the future, if I ever feel like I need more.
** Setup
#+BEGIN_SRC emacs-lisp

  (require 'meow)

  (meow-global-mode 1)

#+END_SRC

#+RESULTS:
: t

** Key Definitions
*** What I Would Like to See
I would like to see an editing system based on:
 - Workman principles
 - I've been thinking about the most optimal editing system, and realized that all of editing basically consists of:
   - Widening or focusing through "containers"
     - Containers include functions, lists, the characters in a symbol, a class, an ordered list, sexps, you name it
   - After focusing on the information that you want to change, you can some things with that data
     - You can view the data, a.k.a. run the data as code through a repl, pull it to a new buffer for viewing, and generally just run operations on the data that won't change it
     - You can mutate the data in several ways
       - You can mutate the data to nil, or basically just deleting the data
       - You can change the data from the beginning or from the end; appending / prepending things
       - You can replace the data with something
         - like a snippet, or just text you've entered
 - Keyboard macros are a great thing; they shrink complexity down, and make it easy to apply the same ideas on different things.
   - It should have something kind of like Beamer, where you can multicursor kmacros.
I've dubbed this new editing system: event-horizon
*** Event Horizon Planning
_SRC emacs-lisp :tangle no
  (define-minor-mode event-horizon-mode)
#+END_SRC

