config.org
*** Meow Substitute for Event Horizon
I feel like the REALLY important commands for me are:
 - Basic movement, word movement ehh
 - Kill thing would be amazing
 - Avy integration would be mwahh
 - So would some other stuff
#+BEGIN_SRC emacs-lisp

  (meow-define-keys
      ;; state
      'normal
    ;; Movement Related Bindings
    '("w" . meow-prev)
    '("s" . meow-next)
    '("a" . meow-left)
    '("d" . meow-right)
    '("z" . backward-word)
    '("x" . forward-word)
    '("q" . beginning-of-line)
    '("e" . end-of-line)
    '("c" . avy-goto-char)
    ;; Selection / Editing Related Bindings
    '("i" . meow-bounds-of-thing)
    '("u" . "C-u - M-d")
    '("j" . meow-kill)
    '("y" . kill-word)
    '("p" . keyboard-quit)
    '("m" . hydra-windows/body)
    '("o" . meow-insert)
    '("k" . consult-buffer)
    '("l" . consult-line)
    '(";" . hydra-clipboard/body)
    '("]" . set-mark-command))


#+END_SRC

#+RESULTS:

** Meow Thing Remapping
#+BEGIN_SRC emacs-lisp
  (setq meow-char-thing-table
        (list (append (string-to-list "i") 'round)
              (append (string-to-list "o") 'square)
              (append (string-to-list "u") 'curly)
              (append (string-to-list "w") 'string)
              (append (string-to-list "q") 'symbol)
              (append (string-to-list "~") 'window)
              (append (string-to-list "s") 'buffer)
              (append (string-to-list "a") 'paragraph)
              (append (string-to-list "d") 'line)
              (append (string-to-list "e") 'visual-line)
              (append (string-to-list "f") 'defun)
              (append (string-to-list "k") 'sentence)))
#+END_SRC

#+RESULTS:
: ((105 . round) (111 . square) (117 . curly) (119 . string) (113 . symbol) (126 . window) (115 . buffer) (97 . paragraph) (100 . line) (101 . visual-line) (102 . defun) (107 . sentence))


* PDF Viewing
This is kind of at Emacs' frontier, as it leaves the realm of text and moves to graphical images.
** DocView
#+BEGIN_SRC emacs-lisp

  (setq doc-view-scale-internally t
        doc-view-resolution 600)

#+END_SRC

#+RESULTS:
: 600

** PDF-tools
#+begin_src emacs-lisp

  (require 'pdf-tools)
  (pdf-tools-install)

#+end_src

#+RESULTS:


* Youtube-DL function
I wrote a youtube-dl function which works alright.
#+begin_src emacs-lisp :results silent

  (defun youtube-dl (link)
    "Interactively downloads a youtube video as music."
    (interactive "MYoutube Link: ")
    (async-shell-command (format "youtube-dl --extract-audio --output=\"C:/Users/linyi/OneDrive/Documents/Music/%%(title)s-%%(id)s.%%(ext)s\" --restrict-filenames --audio-format=\"mp3\" %s" link)))

#+end_src

#+RESULTS:
: youtube-dl


* Org Mode
This is honestly one of the main reasons I use Emacs.
** Built-In
This mainly tweaks some org-mode defaults.
#+BEGIN_SRC emacs-lisp

  (setq org-ellipsis nil)
  (setq org-startup-folded t)
  (add-hook 'org-mode-hook 'visual-line-mode)
  (setq org-startup-indented t)

  (setq org-modules '(org-bibtex
                      org-habit
                      org-info
                      org-bbdb
                      org-inlinetask
                      org-mew))

#+END_SRC

#+RESULTS:
| org-bibtex | org-habit | org-info | org-bbdb | org-inlinetask | org-mew |

** Org Edit Latex
#+begin_src emacs-lisp

  (require 'org-edit-latex)

  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (latex . t)))

  (setq TeX-auto-save t)
  (setq TeX-parse-self t)
  (setq-default TeX-master nil)

#+end_src

#+RESULTS:

** Org Bullets
#+BEGIN_SRC emacs-lisp

  (require 'org-bullets)
  (setq org-hide-leading-stars t)
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
  (setq org-bullets-bullet-list '("â–"))

#+END_SRC

#+RESULTS:
| â–  |

** Org TODO
#+BEGIN_SRC emacs-lisp

  (setq org-todo-keywords
        '((sequence "TODO(t)" "WORKING(w)" "SUBMIT(s)" "|" "DONE(d)" "PUSHED(p)" "RAISED(r)" "CANCELED(c)")))
                                          ; TODO: Tasks I haven't started yet and will do in the near near future
                                          ; WORKING: Tasks I'm currently working on -- this shouldn't exceed 3.
                                          ; SUBMIT: Tasks that I've finished, and am waiting to submit it
                                          ; DONE: Tasks that I don't have to ever think about again
                                          ; PUSHED: Tasks in old task lists that has been pushed to future task lists
                                          ; RAISED: Tasks in old task lists that has been raised up a level
                                          ; CANCELED: Tasks that has been canceled

#+END_SRC

#+RESULTS:
| sequence | TODO(t) | WORKING(w) | SUBMIT(s) |   |   | DONE(d) | PUSHED(p) | RAISED(r) | CANCELED(c) |

** Org Agenda and Task List Creation
#+BEGIN_SRC emacs-lisp :tangle no
  ;; (setq org-default-notes-file (concat "C:/Users/linyi/OneDrive/Documents/School/default.org"))

  ;; (setq org-capture-templates
  ;;       '(("f" "Future Task" entry (file (2e/find-create-task-list "F")))
  ;;         ("q" "Quick Task" entry (file (2e/find-create-task-list "Q")))))

  ;; (defvar 2e/current-task-list
  ;;   nil
  ;;   "Holds the current task list.")

  ;; (defun 2e/parse-task-list-date (full-path)
  ;;   "Takes in an ABSOLUTE file path and parses it into a time. This is intended for usage for my task list structure."
  ;;   (let* ((filename (car (last (split-string full-path (rx "/")))))
  ;;          (date-part (split-string filename (rx ".")))
  ;;          (date-list (split-string (car date-part) "-")))
  ;;     (date-to-time (format "%s, %s %s %s"
  ;;                           (caddr date-list)
  ;;                           (cadr date-list)
  ;;                           (car date-list)
  ;;                           (cadr (split-string (car (last (butlast (split-string
  ;;                                                                    (file-name-parent-directory (file-name-parent-directory full-path))
  ;;                                                                    (rx "/")))))))))))

  ;; (defun 2e/incremental-search-through (list-of-stuff search-for)
  ;;   "goes through ")


  ;; ;; (defun 2e/find-current-task-list ()
  ;; ;;   )

  ;; (defun 2e/create-new-task-list ()
  ;;   (let* ((task-list-dir (concat
  ;;                          "C:/Users/linyi/OneDrive/Documents/School/Planner/"
  ;;                          (format-time-string "%B %Y")
  ;;                          "/Task Pages/"))
  ;;          (task-list-file (concat
  ;;                           task-list-dir
  ;;                           "/"
  ;;                           (format-time-string "%B-%d-%a.org"))))
  ;;     (condition-case nil (make-directory task-list-dir)
  ;;       (error nil))
  ;;     (with-temp-buffer (write-file task-list-file))
  ;;     (setq 2e/current-task-list task-list-file)))

  ;; (defun 2e/check-task-list ()
  ;;   "Returns t if you need to make a new task list, else nil. If there's more than 23 todos in the list, it'll return t."
  ;;   (if (>= (length (org-map-entries t "LEVEL=1" '(list 2e/current-task-list))) 24)
  ;;       (length (org-map-entries t "LEVEL=1" '(list 2e/current-task-list)))
  ;;     nil))

  ;; (setq org-agenda-files (if (2e/check-task-list)
  ;;                            (2eo/create-new-task-list)
  ;;                          2e/current-task-list))

#+END_SRC

#+RESULTS:

** Citation management
Citation management in org mode is great but for fuck's sake is hard to figure out.
*** Citation Exports
#+begin_src emacs-lisp
  (setq org-cite-export-processors
        '((md . (csl "chicago-fullnote-bibliography.csl"))
          (latex biblatex)
          (odt . (csl "chicago-fullnote-bibliography.csl"))
          (t . (csl "modern-language-association.csl"))))
#+end_src

#+RESULTS:
| md    | csl      | chicago-fullnote-bibliography.csl |
| latex | biblatex |                                   |
| odt   | csl      | chicago-fullnote-bibliography.csl |
| t     | csl      | modern-language-association.csl   |

*** Zotra
#+begin_src emacs-lisp
  (require 'zotra)
#+end_src

#+RESULTS:
: zotra


* Vertico
Vertico is a completion system that is (1) fully compatible with Emacs' default completion system and (2) displays the data in a vertical manner, allowing you to view it easier. I use Vertico with Posframe, because I think it looks better.
** Setup
#+BEGIN_SRC emacs-lisp

  (require 'vertico-posframe)
  (vertico-posframe-mode 1)
  (vertico-mode 1)
  (vertico-reverse-mode 1)
  (vertico-mouse-mode 1)
  (vertico-indexed-mode 1)
  (setq vertico-count 15)
  (setq vertico-resize 'grow-only)
  (setq vertico-cycle t)
  (global-set-key (kbd "M-SPC") 'vertico-exit-input)

#+END_SRC

#+RESULTS:
: vertico-exit-input


* Misc.
This is where I put all of the miscellaneous things.
** Persistent Scratch
This saves my scratch buffer along multiple sessions.
#+BEGIN_SRC emacs-lisp
  (persistent-scratch-setup-default)
  (setq persistent-scratch-backup-directory "~/scratch-backups/")
#+END_SRC

#+RESULTS:
: ~/scratch-backups/

** Spacious Padding
This pads the space in between buffer frames.
#+BEGIN_SRC emacs-lisp

  (setq spacious-padding-widths '(:internal-border-width 0 :right-divider-width 1 :scroll-bar-width 0))
  (spacious-padding-mode)

#+END_SRC

#+RESULTS:
: t

** Keyfreq
Keyfreq stores keys pressed, allowing you to obtain statistics on what commands you use the most.
#+BEGIN_SRC emacs-lisp
  (require 'keyfreq)
  (keyfreq-mode 1)
  (keyfreq-autosave-mode 1)
#+END_SRC

#+RESULTS:
: t

** Indent-Guides
#+begin_src emacs-lisp

  (indent-guide-global-mode t)
  (add-hook 'org-mode-hook (lambda () (indent-guide-mode -1)))

#+end_src

#+RESULTS:
| (lambda nil (indent-guide-mode -1)) | (lambda nil (org-bullets-mode 1)) | visual-line-mode | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-fold-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes |

** Olivetti
#+begin_src emacs-lisp

  (require 'olivetti)
  (2e/add-function-to-multiple-hooks 'olivetti-mode '(text-mode-hook
                                                   prog-mode-hook
                                                   Info-mode-hook
                                                   pdf-view-mode-hook
                                                   org-mode-hook))
#+end_src

#+RESULTS:
| text-mode-hook | prog-mode-hook | Info-mode-hook | pdf-view-mode-hook | org-mode-hook |

