config.el

(meow-define-keys
    ;; state
    'normal
  ;; Movement Related Bindings
  '("w" . meow-prev)
  '("s" . meow-next)
  '("a" . meow-left)
  '("d" . meow-right)
  '("z" . backward-word)
  '("x" . forward-word)
  '("q" . beginning-of-line)
  '("e" . end-of-line)
  '("c" . avy-goto-char)
  ;; Selection / Editing Related Bindings
  '("i" . meow-bounds-of-thing)
  '("u" . "C-u - M-d")
  '("j" . meow-kill)
  '("y" . kill-word)
  '("p" . keyboard-quit)
  '("m" . hydra-windows/body)
  '("o" . meow-insert)
  '("k" . consult-buffer)
  '("l" . consult-line)
  '(";" . hydra-clipboard/body)
  '("]" . set-mark-command))

(setq meow-char-thing-table
      (list (append (string-to-list "i") 'round)
            (append (string-to-list "o") 'square)
            (append (string-to-list "u") 'curly)
            (append (string-to-list "w") 'string)
            (append (string-to-list "q") 'symbol)
            (append (string-to-list "~") 'window)
            (append (string-to-list "s") 'buffer)
            (append (string-to-list "a") 'paragraph)
            (append (string-to-list "d") 'line)
            (append (string-to-list "e") 'visual-line)
            (append (string-to-list "f") 'defun)
            (append (string-to-list "k") 'sentence)))

(setq doc-view-scale-internally t
      doc-view-resolution 600)

(require 'pdf-tools)
(pdf-tools-install)

(defun youtube-dl (link)
  "Interactively downloads a youtube video as music."
  (interactive "MYoutube Link: ")
  (async-shell-command (format "youtube-dl --extract-audio --output=\"C:/Users/linyi/OneDrive/Documents/Music/%%(title)s-%%(id)s.%%(ext)s\" --restrict-filenames --audio-format=\"mp3\" %s" link)))

(setq org-ellipsis nil)
(setq org-startup-folded t)
(add-hook 'org-mode-hook 'visual-line-mode)
(setq org-startup-indented t)

(setq org-modules '(org-bibtex
                    org-habit
                    org-info
                    org-bbdb
                    org-inlinetask
                    org-mew))

(require 'org-edit-latex)

(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (latex . t)))

(setq TeX-auto-save t)
(setq TeX-parse-self t)
(setq-default TeX-master nil)

(require 'org-bullets)
(setq org-hide-leading-stars t)
(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
(setq org-bullets-bullet-list '("⁖"))

(setq org-todo-keywords
      '((sequence "TODO(t)" "WORKING(w)" "SUBMIT(s)" "|" "DONE(d)" "PUSHED(p)" "RAISED(r)" "CANCELED(c)")))
                                        ; TODO: Tasks I haven't started yet and will do in the near near future
                                        ; WORKING: Tasks I'm currently working on -- this shouldn't exceed 3.
                                        ; SUBMIT: Tasks that I've finished, and am waiting to submit it
                                        ; DONE: Tasks that I don't have to ever think about again
                                        ; PUSHED: Tasks in old task lists that has been pushed to future task lists
                                        ; RAISED: Tasks in old task lists that has been raised up a level
                                        ; CANCELED: Tasks that has been canceled

(setq org-cite-export-processors
      '((md . (csl "chicago-fullnote-bibliography.csl"))
        (latex biblatex)
        (odt . (csl "chicago-fullnote-bibliography.csl"))
        (t . (csl "modern-language-association.csl"))))

(require 'zotra)

(require 'vertico-posframe)
(vertico-posframe-mode 1)
(vertico-mode 1)
(vertico-reverse-mode 1)
(vertico-mouse-mode 1)
(vertico-indexed-mode 1)
(setq vertico-count 15)
(setq vertico-resize 'grow-only)
(setq vertico-cycle t)
(global-set-key (kbd "M-SPC") 'vertico-exit-input)

(persistent-scratch-setup-default)
(setq persistent-scratch-backup-directory "~/scratch-backups/")

(setq spacious-padding-widths '(:internal-border-width 0 :right-divider-width 1 :scroll-bar-width 0))
(spacious-padding-mode)

(require 'keyfreq)
(keyfreq-mode 1)
(keyfreq-autosave-mode 1)

(indent-guide-global-mode t)
(add-hook 'org-mode-hook (lambda () (indent-guide-mode -1)))

(require 'olivetti)
(2e/add-function-to-multiple-hooks 'olivetti-mode '(text-mode-hook
                                                 prog-mode-hook
                                                 Info-mode-hook
                                                 pdf-view-mode-hook
                                                 org-mode-hook))
