config.org
** Transparency
#+begin_src emacs-lisp
  (set-frame-parameter nil 'alpha-background 70)
  (add-to-list 'default-frame-alist '(alpha-background . 70))

  (defun toggle-transparency ()
    (interactive)
    (let ((alpha (frame-parameter nil 'alpha)))
      (set-frame-parameter
       nil 'alpha
       (if (eql (cond ((numberp alpha) alpha)
                      ((numberp (cdr alpha)) (cdr alpha))
                      ;; Also handle undocumented (<active> <inactive>) form.
                      ((numberp (cadr alpha)) (cadr alpha)))
                100)
           '(85 . 50)
         '(100 . 100)))))

  (global-set-key (kbd "C-c t") 'toggle-transparency)
#+end_src

#+RESULTS:
: toggle-transparency

** Marginalia
Marginalia adds metadata to completion systems. I have to make a new level 1 node for completion frameworks in general and move this there.
#+BEGIN_SRC emacs-lisp

  (require 'marginalia)
  (marginalia-mode 1)
  (setq marginalia-max-relative-age 0)
  (setq marginalia-align 'right)
  (all-the-icons-completion-mode)
  (add-hook 'marginalia-mode 'all-the-icons-completion-marginalia-setup)

#+END_SRC

#+RESULTS:
| all-the-icons-completion-marginalia-setup | t |

** Random stuff
#+begin_src emacs-lisp

  (defun sudden-kill-line ()
    (interactive)
    (move-beginning-of-line nil)
    (kill-line)
    (kill-line)
    (previous-line)
    (end-of-line nil))

  (defun org-fix-latex ()
    (interactive)
    (move-beginning-of-line nil)
    (insert "#+LATEX: "))

  (global-auto-revert-mode t)
  (global-set-key (kbd "C-k") 'sudden-kill-line)
  (global-set-key (kbd "C-c m") 'dabbrev-expand)
  (global-set-key (kbd "C-s") 'consult-line)
  (global-set-key (kbd "C-x b") 'consult-buffer)
  (global-set-key (kbd "C-x o") 'ace-window)
  (global-set-key (kbd "C-c i") 'ibuffer)
  (global-set-key (kbd "C-c a") 'embark-act)

  (setq-default embark-prompter 'embark-completing-read-prompter)

  (defun 2e-eye-break ()
    "A recursive function that calls itself every 20 minutes to remind you to take a break."
    (2e-emacs-remind "Take a 20 second break to protect your eyes." "Eye Doctor")
    (run-with-timer 1200 nil '2e-eye-break))

  (setq inferior-lisp-program "sbcl")

#+end_src

#+RESULTS:
: sbcl


* EMMS (Emacs MultiMedia System)
Playing music is hard with text. This package allows Emacs to do the impossible: play music in Emacs.
** Specific Windows mpv Hack
The default players don't work on Windows, so I had to make my own player.
#+BEGIN_SRC emacs-lisp

  (require 'emms)
  (emms-minimalistic)

  (define-emms-simple-player win-mpv '(file)
                             (regexp-opt '(".mp3" ".mp4" ".mkv" ".webm"))
                             "mpv")

#+END_SRC

#+RESULTS:
: emms-player-win-mpv-playable-p

** Setup
#+BEGIN_SRC emacs-lisp
  (emms-minimalistic)
  (setq emms-player-list '(emms-player-win-mpv)
        emms-info-functions '(emms-info-native))
#+END_SRC

#+RESULTS:
| emms-info-native |


* Electric Pair Mode
#+BEGIN_SRC emacs-lisp
  (defun electric-pair-disable-certain-brackets ()                                                           ; Disables some "unwieldy" brackets so ligatures don't get messed up
    (setq-local electric-pair-inhibit-predicate                                                              ; Sets a predicate for inhibiting the adding of a bracket
                '(lambda (c)
                   (or (char-equal c ?<) (char-equal c ?=)))))                                                ; If the character is equal to < or =, inhibit it

    (2e/add-function-to-multiple-hooks 'electric-pair-disable-certain-brackets '(                               ; Adds function to multiple hooks
                                                                              prog-mode-hook                 ;    Adds to all programming modes
                                                                              org-mode-hook                  ;    Adds to Org Mode
                                                                              text-mode-hook                 ;    Adds to Text Mode
                                                                              ))
#+END_SRC

#+RESULTS:
| prog-mode-hook | org-mode-hook | text-mode-hook |


* Avy
** Default Keys Change
#+BEGIN_SRC emacs-lisp

  (require 'avy)
 avy-keys (string-to-list "wasdiop["))

#+END_SRC

#+RESULTS:
| 119 | 97 | 115 | 100 | 105 | 111 | 112 | 91 |


* Hydra
#+BEGIN_SRC emacs-lisp

  (defhydra hydra-windows ()
    "window splitting and hopping"
    ("w" windmove-delete-up)
    ("s" windmove-delete-down)
    ("a" windmove-delete-left)
    ("d" windmove-delete-right)
    ("u" ace-window)
    ("i" delete-other-windows)
    ("o" delete-window)
    ("q" split-window-below)
    ("e" split-window-right)
    ("z" split-root-window-below)
    ("c" split-root-window-right)
    ("h" shrink-window-horizontally)
    ("l" enlarge-window-horizontally)
    ("j" shrink-window)
    ("k" enlarge-window))

  (defhydra hydra-clipboard ()
    "the emacs infinite clipboard"
    ("i" kill-region)
    ("o" kill-ring-save)
    ("p" nil)
    ("d" yank)
    ("w" yank-from-kill-ring))


#+END_SRC

#+RESULTS:
: hydra-clipboard/body



* Orderless
Orderless is a package that extends on general completion, allowing for better and more exact ways to search for things.
#+BEGIN_SRC emacs-lisp

  (require 'orderless)
  (setq completion-styles '(orderless basic))
  (setq completion-category-defaults nil)
  (setq orderless-component-separator ";")


#+END_SRC

#+RESULTS:
: ;



* Alert Toast
Notifications that work in Windows. Windows isn't a good OS for Emacs, but just in case I need to use Emacs on Windows, this is available.
#+BEGIN_SRC emacs-lisp

  (require 'alert-toast)
  (setq alert-default-style 'toast)

#+END_SRC

#+RESULTS:
: toast



* Progressive Overload Pomodoro (Progodoro)
I watched something that talked about how you could slightly increase the pomodoro times every time to train your brain into focusing more and more for longer periods of time, and decided to implement this into Emacs myself.
** Variables
#+BEGIN_SRC emacs-lisp

  (require 'org-timer)

  ;;; Variable Definitions

  (defvar progodoro-countdown nil
    "Stores the current mode of the progodoro. NIL means that the timer has been reset and that the baseline focus time hasn't been recorded yet. 1 means that either the baseline focus time is being recorded now, or has already been recorded. t means that the baseline focus time has already been raised.")

  (defvar progodoro-focus "00:00:00 "
    "The amount of time the progodoro has gone up to as of now. It is stored as a string of format `HH:MM:SS `.")

  (defvar progodoro-recharging-p nil
    "Whether the progodoro is recharging")

  (defvar progodoro-pity 0
    "Every non-long break that a person gets will increase the pity by an integer between 0 and 5. Before every break, it will roll and if the integer between 0 and (100 - pity) is 0, then it will be a long break and pity will be reset.")

#+END_SRC

#+RESULTS:
: progodoro-pity

