config.el

(set-frame-parameter nil 'alpha-background 70)
(add-to-list 'default-frame-alist '(alpha-background . 70))

(defun toggle-transparency ()
  (interactive)
  (let ((alpha (frame-parameter nil 'alpha)))
    (set-frame-parameter
     nil 'alpha
     (if (eql (cond ((numberp alpha) alpha)
                    ((numberp (cdr alpha)) (cdr alpha))
                    ;; Also handle undocumented (<active> <inactive>) form.
                    ((numberp (cadr alpha)) (cadr alpha)))
              100)
         '(85 . 50)
       '(100 . 100)))))

(global-set-key (kbd "C-c t") 'toggle-transparency)

(require 'marginalia)
(marginalia-mode 1)
(setq marginalia-max-relative-age 0)
(setq marginalia-align 'right)
(all-the-icons-completion-mode)
(add-hook 'marginalia-mode 'all-the-icons-completion-marginalia-setup)

(defun sudden-kill-line ()
  (interactive)
  (move-beginning-of-line nil)
  (kill-line)
  (kill-line)
  (previous-line)
  (end-of-line nil))

(defun org-fix-latex ()
  (interactive)
  (move-beginning-of-line nil)
  (insert "#+LATEX: "))

(global-auto-revert-mode t)
(global-set-key (kbd "C-k") 'sudden-kill-line)
(global-set-key (kbd "C-c m") 'dabbrev-expand)
(global-set-key (kbd "C-s") 'consult-line)
(global-set-key (kbd "C-x b") 'consult-buffer)
(global-set-key (kbd "C-x o") 'ace-window)
(global-set-key (kbd "C-c i") 'ibuffer)
(global-set-key (kbd "C-c a") 'embark-act)

(setq-default embark-prompter 'embark-completing-read-prompter)

(defun 2e-eye-break ()
  "A recursive function that calls itself every 20 minutes to remind you to take a break."
  (2e-emacs-remind "Take a 20 second break to protect your eyes." "Eye Doctor")
  (run-with-timer 1200 nil '2e-eye-break))

(setq inferior-lisp-program "sbcl")

(require 'emms)
(emms-minimalistic)

(define-emms-simple-player win-mpv '(file)
                           (regexp-opt '(".mp3" ".mp4" ".mkv" ".webm"))
                           "mpv")

(emms-minimalistic)
(setq emms-player-list '(emms-player-win-mpv)
      emms-info-functions '(emms-info-native))

(defun electric-pair-disable-certain-brackets ()                                                           ; Disables some "unwieldy" brackets so ligatures don't get messed up
  (setq-local electric-pair-inhibit-predicate                                                              ; Sets a predicate for inhibiting the adding of a bracket
              '(lambda (c)
                 (or (char-equal c ?<) (char-equal c ?=)))))                                                ; If the character is equal to < or =, inhibit it

  (2e/add-function-to-multiple-hooks 'electric-pair-disable-certain-brackets '(                               ; Adds function to multiple hooks
                                                                            prog-mode-hook                 ;    Adds to all programming modes
                                                                            org-mode-hook                  ;    Adds to Org Mode
                                                                            text-mode-hook                 ;    Adds to Text Mode
                                                                            ))

(require 'avy)
(setq avy-keys (string-to-list "wasdiop["))

(defhydra hydra-windows ()
  "window splitting and hopping"
  ("w" windmove-delete-up)
  ("s" windmove-delete-down)
  ("a" windmove-delete-left)
  ("d" windmove-delete-right)
  ("u" ace-window)
  ("i" delete-other-windows)
  ("o" delete-window)
  ("q" split-window-below)
  ("e" split-window-right)
  ("z" split-root-window-below)
  ("c" split-root-window-right)
  ("h" shrink-window-horizontally)
  ("l" enlarge-window-horizontally)
  ("j" shrink-window)
  ("k" enlarge-window))

(defhydra hydra-clipboard ()
  "the emacs infinite clipboard"
  ("i" kill-region)
  ("o" kill-ring-save)
  ("p" nil)
  ("d" yank)
  ("w" yank-from-kill-ring))

(require 'orderless)
(setq completion-styles '(orderless basic))
(setq completion-category-defaults nil)
(setq orderless-component-separator ";")

(require 'alert-toast)
(setq alert-default-style 'toast)

(require 'org-timer)

;;; Variable Definitions

(defvar progodoro-countdown nil
  "Stores the current mode of the progodoro. NIL means that the timer has been reset and that the baseline focus time hasn't been recorded yet. 1 means that either the baseline focus time is being recorded now, or has already been recorded. t means that the baseline focus time has already been raised.")

(defvar progodoro-focus "00:00:00 "
  "The amount of time the progodoro has gone up to as of now. It is stored as a string of format `HH:MM:SS `.")

(defvar progodoro-recharging-p nil
  "Whether the progodoro is recharging")

(defvar progodoro-pity 0
  "Every non-long break that a person gets will increase the pity by an integer between 0 and 5. Before every break, it will roll and if the integer between 0 and (100 - pity) is 0, then it will be a long break and pity will be reset.")

;;; Hooks
