config.el
(add-hook 'org-timer-done-hook (lambda () (if progodoro-recharging-p
                                              (progn (2e-emacs-remind "Your timer has recharged. You can proceed to discharge the timer again." "Progodoro")
                                                     (setq progodoro-recharging-p nil))
                                            (2e-emacs-remind "Your timer has overloaded. Please recharge your timer." "Progodoro"))))

;;; Functions
(defun 2e/recharge-progodoro ()
  (interactive)
  (let* ((capped-p (>= progodoro-pity 95))
         (roll (random (- 100 (if capped-p 95 progodoro-pity))))
               (effort (floor (/ (funcall
                                  (lambda (self numbers add) (funcall self numbers add self))
                                  (lambda (numbers add self) (if (null numbers) 0 (+ (* add (car numbers)) (funcall self (cdr numbers) (/ add 60) self))))
                                  (mapcar #'string-to-number (split-string progodoro-focus ":"))
                                  3600) 50)))
               (pity-increase (random effort)))
         (if (or (= roll 0) (> progodoro-pity 150))
             (progn (setq progodoro-recharging-p t)
                    (org-timer-set-timer (+ 30 (random (if capped-p (+ 70 (- progodoro-pity 95)) 70))))
                    (setq progodoro-pity 0)
                    (message "You are given a long break!"))
           (progn (message (format "Due to your effort of %s, you are given an increase in pity of %s.\nYou rolled a %s." effort pity-increase roll))
                  (setq progodoro-recharging-p t)
                  (setq progodoro-pity (+ pity-increase progodoro-pity))
                  (org-timer-set-timer 5)))))

(defun 2e/discharge-progodoro ()
  (interactive)
  (cond ((not progodoro-countdown) (progn (org-timer-start)
                                          (setq progodoro-countdown 1)
                                          (message "Starting Forge.")))
        ((eq progodoro-countdown 1) (progn (setq progodoro-focus (org-timer-value-string))
                                           (org-timer-stop)
                                           (message "Progodoro Timer Forged.")
                                           (setq progodoro-countdown t)))
        (t (progn (let ((time-list (split-string progodoro-focus (rx ":"))))

                    (setq progodoro-focus (format "%s:%s:%s "
                                                  (string-to-number (car time-list))
                                                  (+ 5 (string-to-number (cadr time-list)))
                                                  (string-to-number (caddr time-list)))))
                  (org-timer-set-timer progodoro-focus)))))

(defun 2e/drain-progodoro ()
  (interactive)
  (org-timer-stop)
  (setq progodoro-recharging-p nil)
  (setq progodoro-countdown nil)
  (setq progodoro-focus "00:00:00 "))


  ;;; Keybindings
(global-set-key (kbd "<home>") '2e/discharge-progodoro)
(global-set-key (kbd "<end>") '2e/recharge-progodoro)
(global-set-key (kbd "<f12>") 'org-timer-pause-or-continue)

(require 'yasnippet)
(yas-global-mode 1)

(require 'flycheck)
(global-flycheck-mode)
(add-hook 'after-init-hook #'global-flycheck-mode)



(require 'org-roam)
(setq org-roam-directory "C:/Users/linyi/OneDrive/Documents/Wiki")
(org-roam-setup)
(global-set-key (kbd "C-c n l") 'org-roam-buffer-toggle)
(global-set-key (kbd "C-c n f") 'org-roam-node-find)
(global-set-key (kbd "C-c n i") 'org-roam-node-insert)
